# RoomSeparationLinesOverlap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..RoomSeparationLinesOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomSeparationLinesOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomSeparationLinesOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomSeparationLinesOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace